/*
Вам даны 18 человек, которые сдавали ЕГЭ. Каждый человек сдавал от 3-х до 5-и экзаменов.

Теперь все эти 18 человек хотят поступить в университет.

Каждый университет для поступления требует свой набор экзаменов.
Места в университете не бесконечные, поэтому каждый университет готов взять только определённый % лучших кандидатов
от общего количества подходящих кандидатов.

Например, если в университет "Cargo-Corgi Technology" проходят 12/18 человек, а университет готов принять только 45%,
значит что из 12 (НЕ 18!!) потенциальных кандидатов будут зачислены только 5.4 человек.
Так как кол-во человек не может быть дробным, округляем кол-во наверх,
то есть для 12 кандидатов и проходом 45% пройдут лучшие 6 человек.

Лучшие N человек - это топ N человек с наивысшей суммой баллов по ТРЕБУЕМЫМ в этом университете предметам (а не всем предметам!).
Например, если:
* Университет требует физика + русский + химия
* Ваня сдал физика-90, русский-90, математика-90
* Саша сдал физика-30, русский-20, химия-10
* Эдик сдал физика-31, русский-21, химия-11
Тогда у Саши в сумме 60 баллов, у Эдика 63 балла,
а Ваня не может быть зачислен, так как он не сдавал химию, хоть по остальным экзаменам у него много баллов.

Если университет готов принять только 20% кандидатов, это значит он готов принять только 1 чел (2 * 0.2 = 0.4 и округление наверх до 1),
значит в таком случае будет зачислен только Эдик.

Если же университет готов принять 51% кандидатов, то значит он готов принять 2 чел (2 * 0.51 = 1.02, округляем наверх до 2),
в таком случае будут зачислены и Саша и Эдик.


Использование циклов for i, for in, for of, while ЗАПРЕЩЕНО🚫
Вы вправе разделять логику на любое количество функций и разных типов.
Лично у меня вышла всего 1 функция с:
* 1 дополнительным вспомогательным типом
* Сначала 1 reduce
  * Внутри этого reduce были:
  * 1 filter
  * 1 reduce (да, я использовал reduce внутри reduce)
* Затем 1 sort для данных, полученных после прошлого reduce
* После этого 1 slice, для данных, полученных после прошлого sort
* И в конце 1 map, для данных, полученных после прошлого slice


Ваша функция для вызовов:

processCandidates(cyber, users)
processCandidates(chemi, users)

должна вывести следующие сообщения:

---------- Информация о поступлении в Cyberuniversity ----------
Для поступления требуются экзамены: Профильная алгебра, Информатика, Физика
Всего подали документы 18 студентов
Сдавали нужные экзамены 6/18 кандидатов.
Университет готов принять 40% лучших из них, то есть 3 студента(ов)
Будут зачислены следующие студенты:
 * Екатерина (255)
 * Павел (251)
 * Татьяна (236)
----------------------------------------------------------------

---------- Информация о поступлении в Chemiuniversity ----------
Для поступления требуются экзамены: Профильная алгебра, Русский язык, Химия
Всего подали документы 18 студентов
Сдавали нужные экзамены 8/18 кандидатов.
Университет готов принять 35% лучших из них, то есть 3 студента(ов)
Будут зачислены следующие студенты:
 * Татьяна (228)
 * Ольга (222)
 * Владимир (209)
----------------------------------------------------------------

 */

// -------- Описания типов. Можете добавлять свои. --------

enum Ex {
  R = 'Русский язык',
  MP = 'Профильная алгебра',
  C = 'Химия',
  P = 'Физика',
  I = 'Информатика',
}

type ExamResult = {
  name: Ex;
  score: number;
};

export type User = {
  id: number;
  name: string;
  exams: ExamResult[];
};

type University = {
  id: number;
  name: string;
  exams: Ex[];
  topPercent: number;
};

// -------- Конец описания типов. --------

// -------- Описания университетов. --------
const cyber: University = {
  id: 2077,
  name: 'Cyberuniversity',
  exams: [Ex.MP, Ex.I, Ex.P],
  topPercent: 40,
};

const chemi: University = {
  id: 228,
  name: 'Chemiuniversity',
  exams: [Ex.MP, Ex.R, Ex.C],
  topPercent: 35,
};
// -------- Конец описания университетов. --------

// Кандидаты
// 👇 Отключаем ESLint и Prettier чтобы строки не переносились
/* eslint-disable */
const users: User[] = [
  {
    id: 4321,
    name: 'Максим',
    exams: [{ name: Ex.MP, score: 75 }, { name: Ex.P, score: 68 }, { name: Ex.R, score: 82 }],
  },
  {
    id: 187,
    name: 'Алексей',
    exams: [{ name: Ex.MP, score: 55 }, { name: Ex.I, score: 90 }, { name: Ex.C, score: 40 }, { name: Ex.R, score: 70 }],
  },
  {
    id: 3298,
    name: 'Дмитрий',
    exams: [{ name: Ex.C, score: 45 }, { name: Ex.MP, score: 65 }, { name: Ex.P, score: 72 }, { name: Ex.I, score: 88 }],
  },
  {
    id: 450,
    name: 'Иван',
    exams: [{ name: Ex.R, score: 33 }, { name: Ex.C, score: 71 }, { name: Ex.MP, score: 80 }, { name: Ex.P, score: 59 }],
  },
  {
    id: 2947,
    name: 'Константин',
    exams: [{ name: Ex.MP, score: 90 }, { name: Ex.I, score: 60 }, { name: Ex.C, score: 50 }],
  },
  {
    id: 1376,
    name: 'Анна',
    exams: [{ name: Ex.R, score: 88 }, { name: Ex.MP, score: 70 }, { name: Ex.P, score: 43 }, { name: Ex.C, score: 38 }],
  },
  {
    id: 4999,
    name: 'Татьяна',
    exams: [{ name: Ex.MP, score: 77 }, { name: Ex.R, score: 66 }, { name: Ex.I, score: 95 }, { name: Ex.P, score: 64 }, { name: Ex.C, score: 85 }],
  },
  {
    id: 2103,
    name: 'Владимир',
    exams: [{ name: Ex.C, score: 49 }, { name: Ex.R, score: 70 }, { name: Ex.MP, score: 90 }, { name: Ex.I, score: 55 }],
  },
  {
    id: 765,
    name: 'Елена',
    exams: [{ name: Ex.R, score: 94 }, { name: Ex.MP, score: 67 }, { name: Ex.P, score: 85 }],
  },
  {
    id: 3822,
    name: 'Сергей',
    exams: [{ name: Ex.P, score: 76 }, { name: Ex.MP, score: 82 }, { name: Ex.I, score: 70 }, { name: Ex.C, score: 65 }],
  },
  {
    id: 154,
    name: 'Наталья',
    exams: [{ name: Ex.R, score: 61 }, { name: Ex.C, score: 55 }, { name: Ex.MP, score: 52 }, { name: Ex.P, score: 58 }],
  },
  {
    id: 2678,
    name: 'Екатерина',
    exams: [{ name: Ex.P, score: 86 }, { name: Ex.MP, score: 91 }, { name: Ex.R, score: 72 }, { name: Ex.I, score: 78 }],
  },
  {
    id: 4815,
    name: 'Марина',
    exams: [{ name: Ex.I, score: 99 }, { name: Ex.MP, score: 85 }, { name: Ex.R, score: 63 }],
  },
  {
    id: 394,
    name: 'Михаил',
    exams: [{ name: Ex.P, score: 60 }, { name: Ex.MP, score: 45 }, { name: Ex.R, score: 48 }],
  },
  {
    id: 2567,
    name: 'Андрей',
    exams: [{ name: Ex.C, score: 85 }, { name: Ex.I, score: 88 }, { name: Ex.MP, score: 65 }, { name: Ex.R, score: 55 }],
  },
  {
    id: 3201,
    name: 'Юлия',
    exams: [{ name: Ex.R, score: 72 }, { name: Ex.C, score: 49 }, { name: Ex.P, score: 70 }],
  },
  {
    id: 987,
    name: 'Павел',
    exams: [{ name: Ex.MP, score: 93 }, { name: Ex.P, score: 81 }, { name: Ex.I, score: 77 }],
  },
  {
    id: 4367,
    name: 'Ольга',
    exams: [{ name: Ex.R, score: 88 }, { name: Ex.P, score: 69 }, { name: Ex.C, score: 74 }, { name: Ex.I, score: 50 }, { name: Ex.MP, score: 60 }],
  },
];
/* eslint-enable */
type Student = {
  id: number;
  name: string;
  exams: Ex;
  summa: number;
};

// 👆 Обратно включаем правила форматирования
const processCandidates = (univer: University, users: User[]) => {
  const filtersExam: Student[] = users
    .reduce((acc: any, cur: User) => {
      // находим необходимые экзамены
      const filterUser = cur.exams.filter((el) => univer.exams.includes(el.name));
      // сумма балов каждого студента
      const summaBallov = filterUser.reduce((acc, sum) => acc + sum.score, 0);
      acc.push({
        id: cur.id,
        name: cur.name,
        exams: filterUser,
        summa: summaBallov,
      });
      return acc;
    }, [])
    .filter((el: any) => el.exams.length === 3);
  // узнаем сколько студентов можем принять
  const numberStudents = Math.ceil(filtersExam.length * (univer.topPercent / 100));
  // сортируем по уменьшению баллов и отсекаем студентов которых можно принять
  const sortStrudent = filtersExam.sort((a: any, b: any) => b.summa - a.summa).slice(0, numberStudents);
  // формируем имя лучших
  const finalSort = sortStrudent.map((el: any) => `* ${el.name} (${el.summa})`);
  // все выводим
  console.log(`---------- Информация о поступлении в ${univer.name} ----------`);
  console.log(`Для поступления требуются экзамены: ${univer.exams.join(', ')}`);
  console.log(`Всего подали документы ${users.length} студентов`);
  console.log(`Сдавали нужные экзамены ${filtersExam.length}/${users.length} кандидатов.`);
  console.log(`Университет готов принять ${univer.topPercent}% лучших из них, то есть ${numberStudents} студента(ов)`);
  console.log('Будут зачислены следующие студенты:');
  console.log(finalSort.join('\n'));

  return '';
};
// Вызов функций:

console.log(processCandidates(cyber, users));
processCandidates(chemi, users);
